# WSScript_GetObject

## Description
This function must be used inside a worksheet script called by 'RunScript' worksheet formula.

```pascal
FUNCTION WSScript_GetObject : HANDLE;
```

```python
def vs.WSScript_GetObject():
    return HANDLE
```

## Remarks
[[User:CBM-c-| _c_]] (2021.02.08):
See excellent intrduction to Worksheet Scripting by Pat Stanford on the Techboard:

forum.vectorworks.net/index.php?/topic/75193-a-super-short-course-in-worksheet-scripts/

## See Also
VS Functions:
WSScript_GetObject
| WSScript_GetPrmInt
| WSScript_GetPrmReal
| WSScript_GetPrmStr
| WSScript_SetResStr
| WSScript_SetResReal
| WSScript_SetResImage

## Version
Availability: from Vectorworks 2016

## Category
* Worksheets